In [104]:
#Instalación de Librerias
import pandas as pd
import numpy as np
# -----------------------------------------------------------------------
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer
# ------------------------------------------------------------------------------
import scipy.stats as stats
from scipy.stats import shapiro
from scipy.stats import mannwhitneyu

# -----------------------------------------------------------------------

import seaborn as sns
import matplotlib.pyplot as plt
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) 
import warnings
warnings.filterwarnings("ignore")

# Fase 1. Exploración y Limpieza

## 1.1 Exploración inicial

In [105]:
#Lectura de los ficheros
flight=pd.read_csv('Customer Flight Activity.csv')
loyalty=pd.read_csv('Customer Loyalty History.csv')

### 1.1.1 Exploracion de datos columnas e información general

#### A) Fichero Flight

In [106]:
# Mostrar las primeras y las últimas  filas de cada archivo
## Fichero flight
flight.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [107]:
flight.tail()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
405619,999902,2018,12,0,0,0,0,0.0,0,0
405620,999911,2018,12,0,0,0,0,0.0,0,0
405621,999940,2018,12,3,0,3,1233,123.0,0,0
405622,999982,2018,12,0,0,0,0,0.0,0,0
405623,999986,2018,12,0,0,0,0,0.0,0,0

In [108]:
# Estudio de la estructura del fichero
flight.shape
print(f"En el DataFrame tenemos un total de {flight.shape[0]} filas y {flight.shape[1]} columnas.")

En el DataFrame tenemos un total de 405624 filas y 10 columnas.

In [109]:
# Obtener información general de cada DataFrame
flight.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

#### B) Fichero Loyalty

In [110]:
## Fichero Loyalty
loyalty.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [111]:
loyalty.tail()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
16732,823768,Canada,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,NaN,NaN
16733,680886,Canada,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,89210.0,Married,Star,67907.27,Standard,2014,9,NaN,NaN
16734,776187,Canada,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN
16735,906428,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018,4,NaN,NaN
16736,652627,Canada,Manitoba,Winnipeg,R2C 0M5,Female,Bachelor,75049.0,Married,Star,83325.38,Standard,2015,12,2016.0,8.0

In [112]:
loyalty.shape

print(f"En el DataFrame tenemos un total de {loyalty.shape[0]} filas y {loyalty.shape[1]} columnas.")

En el DataFrame tenemos un total de 16737 filas y 16 columnas.

In [113]:
# Obtener información general de cada DataFrame
loyalty.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

### 1.1.2 Analisis de Duplicados

#### A) Fichero Flight

In [114]:
# Identificar filas duplicadas en flight
duplicates_flight = flight[flight.duplicated()]

# Contar el número de filas duplicadas
num_duplicates_flight = len(duplicates_flight)

print(f"Número total de filas duplicadas en flight: {num_duplicates_flight}")

Número total de filas duplicadas en flight: 1864

In [115]:
# Mostrar las filas duplicadas
print("\nFilas duplicadas en flight:")

duplicates_flight

Filas duplicadas en flight:

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
42,101902,2017,1,0,0,0,0,0.0,0,0
227,112142,2017,1,0,0,0,0,0.0,0,0
478,126100,2017,1,0,0,0,0,0.0,0,0
567,130331,2017,1,0,0,0,0,0.0,0,0
660,135421,2017,1,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
404668,949628,2018,12,0,0,0,0,0.0,0,0
404884,960050,2018,12,0,0,0,0,0.0,0,0
405111,971370,2018,12,0,0,0,0,0.0,0,0
405410,988392,2018,12,0,0,0,0,0.0,0,0
405437,989528,2018,12,0,0,0,0,0.0,0,0

In [116]:
# Identificar  todas las filas  duplicadas en flight ya que con el código anterior no puedo identifcar el patron
duplicates_flight = flight[flight.duplicated(keep=False)] # Al añadir keep=False vemos que todas las instancias de duplicados se muestre

In [117]:
# Mostrar toda la información de los registros duplicados usando iloc
print("Registros completamente duplicados en flight:")
# Hemos usado un iloc para flitrar todos los duplicados de flight donde  donde iloc[:, :]muestra la informacion de todas las columnas y filas
print(duplicates_flight.iloc[:, :])

Registros completamente duplicados en flight:
        Loyalty Number  Year  Month  Flights Booked  Flights with Companions  \
41              101902  2017      1               0                        0
42              101902  2017      1               0                        0
226             112142  2017      1               0                        0
227             112142  2017      1               0                        0
477             126100  2017      1               0                        0
...                ...   ...    ...             ...                      ...
405111          971370  2018     12               0                        0
405409          988392  2018     12               0                        0
405410          988392  2018     12               0                        0
405436          989528  2018     12               0                        0
405437          989528  2018     12               0                        0

        Total Flights  Distance  Points Accumulated  Points Redeemed  \
41                  0         0                 0.0                0
42                  0         0                 0.0                0
226                 0         0                 0.0                0
227                 0         0                 0.0                0
477                 0         0                 0.0                0
...               ...       ...                 ...              ...
405111              0         0                 0.0                0
405409              0         0                 0.0                0
405410              0         0                 0.0                0
405436              0         0                 0.0                0
405437              0         0                 0.0                0

        Dollar Cost Points Redeemed
41                                0
42                                0
226                               0
227                               0
477                               0
...                             ...
405111                            0
405409                            0
405410                            0
405436                            0
405437                            0

[3712 rows x 10 columns]

Como podemos observar los valores duplicados se encuentran el la columna "Loyalty Number" que repite la misma información en las filas que tienen el mismo "Loyalty Number"

In [118]:
# Tratamiento de los valores duplicados
# Al ver que los duplicados son el loyalty number que repite la misma información en varias filas hemos decidido proceder a su eliminacion.
#Vamos a usar drop para eliminar los duplicados y aplicamos inplace=True para que los cambios se mantengan en el df original

In [119]:
# Eliminar duplicados en flight y modificar el dataframe original
flight.drop_duplicates(inplace=True)

# Resetear el índice del dataframe después de eliminar duplicados
flight.reset_index(drop=True)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
403755,999902,2018,12,0,0,0,0,0.0,0,0
403756,999911,2018,12,0,0,0,0,0.0,0,0
403757,999940,2018,12,3,0,3,1233,123.0,0,0
403758,999982,2018,12,0,0,0,0,0.0,0,0
403759,999986,2018,12,0,0,0,0,0.0,0,0

In [123]:
# Contar el número de registros duplicados basados en todas las columnas
num_registros_duplicados = flight.duplicated().sum()

# Mostrar el número de registros duplicados
print(f"Número de registros duplicados en flight: {num_registros_duplicados}")

Número de registros duplicados en flight: 0

In [124]:
print(f"En el DataFrame final tenemos un total de {flight.shape[0]} filas y {flight.shape[1]} columnas.")

En el DataFrame final tenemos un total de 403760 filas y 10 columnas.

#### B) Fichero Loyalty

In [125]:
# Identificar filas duplicadas en loyalty
duplicates_loyalty = loyalty[loyalty.duplicated()]

# Contar el número de filas duplicadas
num_duplicates_loyalty = len(duplicates_loyalty)

print(f"Número total de filas duplicadas en loyalty: {num_duplicates_loyalty}")

Número total de filas duplicadas en loyalty: 0

### 1.1.3 Analisis de los valores nulos

In [121]:
# Valores nulos en loyalty
print("Valores nulos en loyalty:")
print((loyalty.isnull().sum() / len(loyalty)) * 100)

Valores nulos en loyalty:
Loyalty Number         0.000000
Country                0.000000
Province               0.000000
City                   0.000000
Postal Code            0.000000
Gender                 0.000000
Education              0.000000
Salary                25.321145
Marital Status         0.000000
Loyalty Card           0.000000
CLV                    0.000000
Enrollment Type        0.000000
Enrollment Year        0.000000
Enrollment Month       0.000000
Cancellation Year     87.650117
Cancellation Month    87.650117
dtype: float64

In [122]:
# Valores nulos en flight
print("Porcentaje de valores nulos en flight:")
print((flight.isnull().sum() / len(flight)) * 100)

Porcentaje de valores nulos en flight:
Loyalty Number                 0.0
Year                           0.0
Month                          0.0
Flights Booked                 0.0
Flights with Companions        0.0
Total Flights                  0.0
Distance                       0.0
Points Accumulated             0.0
Points Redeemed                0.0
Dollar Cost Points Redeemed    0.0
dtype: float64